//2. Напишіть умовну інструкцію if, що перевіряє, чи знаходиться значення ціни товару між 1000 та 1900 включно.
//     Результат виводити в консоль.
let price= 1900;
if (price >=1000 && price <=1900) {
    console.log("Ціна товару знаходиться між 1000 до 1900 включно.");
}

//1. Ви прийшли в Макдональдз з трьома друзями.
//     Всі вони хочуть зʼїсти гамбургер. Ви хочете зʼїсти гамбургер з картоплею.
//     Реалізувати код, який буде перевіряти, що якщо всім вистачає гамбургерів і картоплі,
//     то виводити текст "Ми поїли" в консоль. Якщо на всіх не вистачає їжі,
//     то виводити в консоль текст "Ми йдемо в інше кафе"
//     (Змінні типу інтеджер містять кількість продуктів в наявності у вигляді вхідних даних)
let Hamburger = 4;
let Potato= 0;
if (Hamburger>=4 && Potato>=1) {
    console.log("Ми поїли")
} else {
    console.log("Ми йдемо в інше кафе")
}

// 3.  Напишіть умовну інструкцію if, щоб перевіряє, чи значення ціни товару не знаходиться між 1000 та 1900 включно.
//     Реалізуйте два варіанти, один з оператором НЕ !, а інший без цього оператора.
//     Результат виводити в консоль.
let price2 = 20000;
if (!price2 >=1000 && !price2 <=1900) {
    console.log("Ціна товару не знаходиться між 1000 до 1900.");
}
let price3 =1800;
if (price3 < 1000 || price3 >1900) {
    console.log("Ціна товару не знаходиться між 1000 до 1900.");
}

// 4 За номером пори року вивести назву цієї пори року використовуючи інструкцію if-else-if
// Результат виводити в консоль.
let season = 1;
if (season ===1) {
    console.log("Its winter")
} else if (season===2){
    console.log("Its spring")
} else if (season===3) {
    console.log("Its summer")
} else if (season===4){
    console.log("Its fall")
}

//     5. Задано 3 числа (a, b, c), які не рівні між собою.
//     Використовуючи вкладені умовні оператори (інструкції) if визначте середнє між цими трьома числами
//     (не середнє арифметичне значення, а яке з трьох заданих чисел среднє за значенням)
//     Результат виводити в консоль.



//     6. Задано номер дня тижня.
//     За заданим номером вивести назву дня тижня використовуючи switch.
//     Результат виводити в консоль.
let dayNumber = 5;
switch (dayNumber) {
    case 1:
        console.log("Понеділок");
        break;
    case 2:
        console.log("Вівторок")
        break
    case 3:
        console.log("Середа");
        break
    case 4:
        console.log("Четвер");
        break
    case 5:
        console.log("Пятниця");
        break
    case 6:
        console.log("Субота");
        break
    case 7:
        console.log("Неділя");
        break
}
//    7. За допомогою switch реалізуйте обчислення виразу, передаючи у switch, як параметр, символ математичної операції.
//     Математичні операції для обчислення: "+", "-", "*", "/".
//     Результат виводити в консоль.
let a=4;
let b=3;
let operator = "+";
switch (operator) {
    case "+":
        console.log(a+b);
        break
    case "-":
        console.log(a-b);
        break
    case "*":
        console.log(a-b);
        break
    case "/":
        console.log(a/b)
        break
}

// 8. Використовуючи цикл for перемістити значення від 1 до 5 у масив myArray.
let myArray = [];
for (let i = 1; i <=5; i++) {
    myArray.push(i) }
console.log(myArray);

// 9. Напишіть 2 цикли.
//    За допомогою першого передайте парні числа від 1 до 9 у змінну myArray за допомогою циклу for.
//    За допомогою другого передайте непарні числа від 1 до 9 у змінну myArray за допомогою циклу for.
let myArray2 = [];
for (let i=1; i <=9; i++) {
    if(i % 2 === 0) {
        myArray2.push(i)
    }
}
console.log(myArray2)

let myArray3 = [];
for (let i=1; i <=9; i++) {
    if(i % 2 ===! 0) {
        myArray3.push(i)
    }
}
console.log(myArray2)

// 10. Оголоcіть та ініціалізуйте змінну total = 0.
//     Використовуйте цикл for, щоб додати значення кожного елемента масиву myArr до підсумку.
//     const myArr = [2, 3, 4, 5, 6];
let total = 1;
const myArr3 = [2, 3, 4, 5, 6];
for (let i=0; i<myArr3.length; i++) {
    total+=myArr3[i]
}
console.log(total);


// 11. Напишіть код, котрий виведе в консоль кожен піделемент в arr по одному.
//
//     const arr = [ [1, 2], [3, 4], [5, 6] ];
//
//     Console output:
//     1
//     2
//     3
//     4
//     5
//     6
const array = [ [1, 2], [3, 4], [5, 6] ];
const newarray = array.join().split(",");
newarray.forEach((element) => {
    console.log(element);
});

// 12. Доповніть код нижче, так щоб в консоль повертався результат множення усіх чисел у підмасивах arr.
//     Використайте для цього вкладені цикли for.
//
const arr4 = [[1, 2], [3, 4], [5, 6, 7]];
let product = 1;
for (let i=0; i<arr4.length; i++) {
    for (let j=0; j<arr4[i].length;j++){
        product*=arr4[i][j];
    }

}
console.log(product);

